soap-xml/get_progress.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope 
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!-- http://www.w3.org/2003/05/soap-envelope -->
  <soapenv:Body>
    <m:getProgress xmlns:m="com.poshwolf.ws"> 
      <taskId>3</taskId>
   </m:getProgress> 
  </soapenv:Body>
</soapenv:Envelope>

